app/Http/Controllers/ClientController.php

    public function index(request $request):\Illuminate\View\View
    {
        $Category = Category::all();
        $products = Product::active()
        ->name($request->input('filter.name'))
        ->paginate(4);
---
select * from `categories`
select count(*) as aggregate from `products` where `active` = 1