app/Http/Controllers/ProductController.php

    public function index(Request $request)
    {
     $products = Product::name($request->input('filter.name'))->paginate(2);
---
select * from `products` where `name` like '%twister%' limit 2 offset 0
select count(*) as aggregate from `products` where `name` like '%twister%'