app/Http/Controllers/UserController.php

select * from `users`
---
    public function index()
    {
        $users=User::all();